{
  "instance_id": "UTBUI5",
  "problem_statement": "Our logistics startup, SwiftDrop, needs a secure fullstack portal to manage neighborhood parcel lockers. This 'Parcel Locker Access Portal' will be built using Next.js (with an integrated API layer). The system allows courier services to register packages and residents to retrieve them using unique access codes. You must implement the following fullstack workflow: 1. A courier dashboard to 'Check In' a package (inputting recipient email and locker number). 2. An automated server-side logic to generate a secure, single-use 6-digit numeric PIN. 3. A 'Resident Interface' where entering the correct PIN marks the package as 'COLLECTED' and unlocks the locker. The challenge is managing the security of the PIN lifecycle and the locker state. You must implement 'Expiring Credentials'—if a package is not collected within 48 hours, the locker state should transition to 'EXPIRED' and the PIN should be invalidated. The frontend must reflect these state changes in real-time or via revalidation. You are responsible for both the relational schema design (using any provided or suggested ORM pattern) and the frontend view logic to prevent a 'Leaky PIN' scenario (where PINs are accidentally sent to the frontend before the correct resident authentication). Problem Statement: Fullstack development of a physical asset management system. Key requirements involve secure credential generation, managing a time-sensitive state machine for lockers (AVAILABLE -> OCCUPIED -> COLLECTED/EXPIRED), and implementing basic security hygiene for private PIN data in a React/Next.js environment. Requirements: 1. Database Schema: Define tables for `Lockers` (id, size, status) and `Parcels` (recipient, locker_id, pin_hash, expires_at, status). 2. Security Logic: Store the PINs using a secure one-way hashing function; the raw PIN must never be stored directly in the database and only shown once to the courier. 3. State Management: Implement a backend background worker or a revalidation hook that transitions `OCCUPIED` lockers to `EXPIRED` once the `expires_at` timestamp is passed. 4. Collision Prevention: Ensure that a courier cannot 'Check In' a package into a locker that is already marked as `OCCUPIED`. 5. Frontend UI: Create a 'Courier Check-In' form and a 'Resident PIN Pad' UI. Use React state to handle loading indicators and error messages (e.g., 'Invalid PIN', 'Locker Already Empty'). 6. API Constraints: Residents should not be able to list all parcels; the retrieval API must require the recipient's email *and* the PIN to return a success status. 7. Testing Requirement: Write an integration test where a package is checked in with an `expires_at` 5 seconds in the past; verify that the Resident UI returns 'PIN Expired'. 8. Testing Requirement: Verify that after a parcel is 'COLLECTED', the associated locker ID transitions back to the `AVAILABLE` status for the next courier.",
  "base_commit": "repository_before/",
  "repo": "https://github.com/ep-eaglepoint-ai/bd_datasets_003/tree/main/utbui5-parcel-locker-access-portal",
  "FAIL_TO_PASS": [
    "API Routes Integration Tests > Requirement 7: API Constraints > should require both email and PIN for PIN verification",
    "API Routes Integration Tests > Requirement 7: API Constraints > should not provide endpoint to list all parcels",
    "API Routes Integration Tests > API Logic Tests > should successfully create parcel with PIN hash",
    "API Routes Integration Tests > API Logic Tests > should return PIN expired for expired package",
    "API Routes Integration Tests > API Logic Tests > should successfully collect package and release locker",
    "API Routes Integration Tests > API Logic Tests > should reject invalid PIN",
    "Parcel Locker Access Portal Integration Tests > Requirement 7: PIN Expiration Test > should return PIN expired when package expires_at is 5 seconds in the past",
    "Parcel Locker Access Portal Integration Tests > Requirement 7: PIN Expiration Test > should return PIN expired via API when package expires_at is 5 seconds in the past",
    "Parcel Locker Access Portal Integration Tests > Requirement 8: State Transition Test > should transition locker back to AVAILABLE after parcel is COLLECTED",
    "Parcel Locker Access Portal Integration Tests > Requirement 8: State Transition Test > should transition locker to AVAILABLE via API when parcel is COLLECTED",
    "Parcel Locker Access Portal Integration Tests > Additional Integration Tests > should prevent check-in to already OCCUPIED locker",
    "Parcel Locker Access Portal Integration Tests > Additional Integration Tests > should store PIN as hash, not raw value"
  ],
  "PASS_TO_PASS": []
}
