{
    "instance_id": "JE0CF7",
    "problem_statement": "Working on a development tools team that needs to implement live reload functionality for a custom static site generator. The current build system in tools/builder.py requires manual re-execution whenever source files change, which slows down the content authoring workflow significantly. The goal is to create a file watching utility that detects changes to markdown and template files in the source directory and triggers rebuild callbacks automatically.",
    "base_commit": "repository_before/",
    "test_patch": "tests/",
    "github_url": "https://github.com/ep-eaglepoint-ai/bd_datasets_003/tree/main/je0cf7-async-file-watcher",
    "environment_setup": "Dockerfile",
    "FAIL_TO_PASS": [
        "Test async context manager __aenter__.",
        "Test that context manager cleans up on exit.",
        "Test that initializing with file path raises ValueError.",
        "Test that initializing with non-existent directory raises ValueError.",
        "Test that initialization stores absolute path.",
        "Test initialization with all parameters specified.",
        "Test initialization with custom debounce interval.",
        "Test initialization with extension filter.",
        "Test that watcher initializes correctly with valid directory.",
        "Test that callback fires after debounce interval.",
        "Test that rapid changes to same file result in single callback.",
        "Test that only files with matching extensions trigger callbacks.",
        "Test filtering with multiple extensions.",
        "Test that without extension filter, all files are watched.",
        "Test that callback receives file_path and event_type.",
        "Test that file creation is detected.",
        "Test that file deletion is detected.",
        "Test that file modification is detected.",
        "Test that one callback failure doesn't stop other callbacks.",
        "Test that all registered callbacks are invoked.",
        "Test that on_change accepts async callbacks.",
        "Test that on_change accepts lambda functions.",
        "Test that on_change properly registers callbacks.",
        "Test that multiple callbacks can be registered.",
        "Test watching nested components like /project/src/components/header.html.",
        "Test that files in subdirectories are detected.",
        "Test that resources are cleaned up after stop.",
        "Test that stop causes start to exit without raising exceptions.",
        "Test that start is awaitable.",
        "Test that start yields control to event loop.",
        "Test that calling stop before start doesn't raise an exception.",
        "Test that stop sets _running flag to False."
    ],
    "PASS_TO_PASS": []
}