{
  "instance_id": "JU2IRN",
  "problem_statement": "A retail company has developed an Express backend API for managing their warehouse inventory. The API handles product tracking, stock level management, and inventory transactions such as restocking and fulfilling orders. The development team rushed to meet a deadline and the API is now in production, but they never wrote proper tests. Recent bugs in production have caused inventory discrepancies that cost the company significant money, and management has mandated comprehensive test coverage before any new features can be added. The QA team needs a complete test suite that validates all API endpoints, business logic, edge cases, and error handling. The tests must be thorough enough to catch regressions and serve as documentation for expected API behavior. Additionally, the team wants meta-tests that validate the test suite itself is properly structured and achieves adequate coverage.",
  "base_commit": "repository_before/",
  "test_patch": "tests/",
  "github_url": "https://github.com/ep-eaglepoint-ai/bd_datasets_003/tree/main/ju2irn-inventory-management-api",
  "environment_setup": "Dockerfile",
  "FAIL_TO_PASS": [],
  "PASS_TO_PASS": [
    "should return all products when products exist",
    "should return empty array when no products exist",
    "should return filtered products when category query parameter is provided",
    "should return empty array when category filter matches no products",
    "should return all products when category parameter is empty string",
    "should return 201 with created product when all required fields are provided",
    "should return product with default category when category is not provided",
    "should return product with zero stock when stockLevel is not provided",
    "should return product with price of zero when price is zero",
    "should return 409 conflict error when SKU already exists",
    "should return 400 with validation message when sku is missing",
    "should return 400 with validation message when name is missing",
    "should return 400 with validation message when price is missing",
    "should return 400 when price is negative",
    "should return 400 when price is not a number",
    "should handle product creation with very long name",
    "should handle product creation with decimal price",
    "should return correct product when valid ID is provided",
    "should return 404 when product ID does not exist",
    "should return 400 when ID format is invalid (non-numeric)",
    "should return 404 when ID is a float string parsed as integer",
    "should return 404 when ID is zero",
    "should return 404 when ID is negative",
    "should return updated product when valid update data is provided",
    "should allow partial updates when only some fields are provided",
    "should update SKU when new SKU is unique",
    "should update category when provided",
    "should return 409 when updating to duplicate SKU",
    "should return 404 when updating non-existent product",
    "should return 400 when updating price to negative value",
    "should return 400 when updating price to non-number",
    "should allow updating price to zero",
    "should allow updating SKU to same value",
    "should return 204 when product is successfully deleted",
    "should make deleted product no longer retrievable",
    "should remove deleted product from product list",
    "should return 404 when deleting non-existent product",
    "should return 404 when deleting already deleted product",
    "should increase stock level correctly when valid quantity is provided",
    "should handle multiple restocks correctly",
    "should handle restock with decimal quantity",
    "should return 400 when quantity is zero",
    "should return 400 when quantity is negative",
    "should return 404 when restocking non-existent product",
    "should return 400 when quantity is not a number",
    "should return 400 when quantity is missing",
    "should handle very large restock quantities",
    "should decrease stock level correctly when valid quantity is provided",
    "should include updated stock level in response",
    "should allow fulfilling entire stock",
    "should return 400 with insufficient stock message when fulfilling more than available",
    "should return 404 when fulfilling non-existent product",
    "should fail when fulfilling from zero stock",
    "should return products below default threshold of 10",
    "should respect custom threshold query parameter",
    "should return empty array when all products have sufficient stock",
    "should include products with exactly zero stock",
    "should not include products at exactly the threshold",
    "should use default threshold when threshold is zero (falsy)",
    "should handle very high threshold",
    "should correctly track stock through restock followed by fulfill",
    "should prevent overfulfillment after partial fulfillment",
    "should handle complete product lifecycle from creation to deletion",
    "should correctly identify low stock products after fulfillment"
  ]
}
